# git init -> Превращает текущую директорияю в Git репоззиторий (создается директория .git)
# git add . (. -> все файлы, так же можно указать просто файл) -> отслеживание всех файлов
# git commit -m 'comment' -> добавляет\ совершавет в git всех файлов которые накходятся в индексе
# git log -> выводит журналы сохранений (log)
# git status -> статус наших файлов  показывает
# git romete add ogigin(название связи) SSH (ссылка на удаленый репозиторий)
# git checkout hash_commit -> просматриваем версию
# git branch -> выводит в терминал список всех веток (* -> ветка в которой ты находишься)
# git chekout <название_ветки>
# 				- переход на указонную ветку
# git switch <название ветки>

# git push origin(название связи) master(название ветки) -> отправка нашей версии кода на удаленый репозитрий

# git clone <передаем ссылку на удаленый репозитоий> -> склонировать, скопировать, скачать репозитроий
